In [12]:
import pandas as pd
import numpy as np

data = {
    "Name":['Aavash', 'Aryam', 'Noah', 'Bibek'],
    "Age":[20, 21, 29, 12],
    "City":['Imadol', 'Mangalbazar', 'Bhaktapur', 'Pimbahal'],
    "Salary":[20000, 21000, 29, np.nan],
}
df = pd.DataFrame(data)
df

     Name  Age         City   Salary
0  Aavash   20       Imadol  20000.0
1   Aryam   21  Mangalbazar  21000.0
2    Noah   29    Bhaktapur     29.0
3   Bibek   12     Pimbahal      NaN

In [2]:
df.isnull().sum()

Name      0
Age       0
City      0
Salary    1
dtype: int64

In [5]:
df.notnull()

   Name   Age  City  Salary
0  True  True  True    True
1  True  True  True    True
2  True  True  True    True
3  True  True  True   False

In [4]:
df.notnull().sum()

Name      4
Age       4
City      4
Salary    3
dtype: int64

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
 3   Salary  3 non-null      float64
dtypes: float64(1), int64(1), object(2)
memory usage: 260.0+ bytes

In [7]:
df.dropna()

     Name  Age         City   Salary
0  Aavash   20       Imadol  20000.0
1   Aryam   21  Mangalbazar  21000.0
2    Noah   29    Bhaktapur     29.0

In [10]:
df.dropna(inplace=True)

In [13]:
df

     Name  Age         City   Salary
0  Aavash   20       Imadol  20000.0
1   Aryam   21  Mangalbazar  21000.0
2    Noah   29    Bhaktapur     29.0
3   Bibek   12     Pimbahal      NaN

In [19]:
import pandas as pd
import numpy as np

data = {
    "Name":['Aavash', 'Aryam', 'Noah', 'Bibek','Aavash', 'Aryam', 'Noah', 'Bibek'],
    "Age":[20, 21, 29, 12,20, 21, 29, 12],
    "City":['Imadol', 'Mangalbazar', 'Bhaktapur', 'Pimbahal','Imadol', 'Mangalbazar', 'Bhaktapur', 'Pimbahal'],
    "Salary":[20000, 21000, 29, np.nan,20000, 21000, 29, 1000],
}
df = pd.DataFrame(data)
df

     Name  Age         City   Salary
0  Aavash   20       Imadol  20000.0
1   Aryam   21  Mangalbazar  21000.0
2    Noah   29    Bhaktapur     29.0
3   Bibek   12     Pimbahal      NaN
4  Aavash   20       Imadol  20000.0
5   Aryam   21  Mangalbazar  21000.0
6    Noah   29    Bhaktapur     29.0
7   Bibek   12     Pimbahal   1000.0

In [20]:
df.drop_duplicates(inplace=True)
df

     Name  Age         City   Salary
0  Aavash   20       Imadol  20000.0
1   Aryam   21  Mangalbazar  21000.0
2    Noah   29    Bhaktapur     29.0
3   Bibek   12     Pimbahal      NaN
7   Bibek   12     Pimbahal   1000.0

In [21]:
df.dropna(subset=['Salary'])

     Name  Age         City   Salary
0  Aavash   20       Imadol  20000.0
1   Aryam   21  Mangalbazar  21000.0
2    Noah   29    Bhaktapur     29.0
7   Bibek   12     Pimbahal   1000.0

In [22]:
df

     Name  Age         City   Salary
0  Aavash   20       Imadol  20000.0
1   Aryam   21  Mangalbazar  21000.0
2    Noah   29    Bhaktapur     29.0
3   Bibek   12     Pimbahal      NaN
7   Bibek   12     Pimbahal   1000.0

In [32]:
# boxplot
data = {
    "Name":['Aavash', 'Aryam', 'Noah', 'Bibek'],
    "Score":[100, 85, np.nan, 82.5],
    }
df = pd.DataFrame(data)
df

     Name  Score
0  Aavash  100.0
1   Aryam   85.0
2    Noah    NaN
3   Bibek   82.5

In [33]:
Q1 = df['Score'].quantile(0.25)
Q3 = df['Score'].quantile(0.75)
IQR = Q3-Q1
print(Q1,Q3, IQR)

lower_bound = Q1 - 1.5 *IQR
upper_bound = Q1 + 1.5 *IQR

outliers = df[(df['Score']<lower_bound)| (df['Score']>upper_bound)]
outliers

83.75 92.5 8.75

     Name  Score
0  Aavash  100.0

In [34]:
df.fillna(df['Score'].mean())

     Name       Score
0  Aavash  100.000000
1   Aryam   85.000000
2    Noah   89.166667
3   Bibek   82.500000

In [40]:
df.fillna(df['Score'].median())

     Name  Score
0  Aavash  100.0
1   Aryam   85.0
2    Noah   85.0
3   Bibek   82.5